Materials-Testing-Lab/hc32-hal/dts/hc32/hc32l19x-pinctrl.h
#ifndef HC32_ZEPHYR_DRIVER_PINCTRL_H
#define HC32_ZEPHYR_DRIVER_PINCTRL_H

#define GpioPortA 0x00
#define GpioPortB 0x40
#define GpioPortC 0x80
#define GpioPortD 0xc0
#define GpioPortE 0x1000
#define GpioPortF 0x1040

#define GpioPin0  0
#define GpioPin1  1
#define GpioPin2  2
#define GpioPin3  3
#define GpioPin4  4
#define GpioPin5  5
#define GpioPin6  6
#define GpioPin7  7
#define GpioPin8  8
#define GpioPin9  9
#define GpioPin10 10
#define GpioPin11 11
#define GpioPin12 12
#define GpioPin13 13
#define GpioPin14 14
#define GpioPin15 15

#define GpioAf0  0
#define GpioAf1  1
#define GpioAf2  2
#define GpioAf3  3
#define GpioAf4  4
#define GpioAf5  5
#define GpioAf6  6
#define GpioAf7  7
#define GpioAfa  8

#define PINMUX(port, pin, af) ((port) << 16 | (pin) << 8 | (af))

#define PA00_UART1_CTS    (GpioPortA<<16|GpioPin0 <<8|GpioAf1)
#define PA01_UART1_RTS    (GpioPortA<<16|GpioPin1 <<8|GpioAf1)
#define PA02_UART1_TXD    (GpioPortA<<16|GpioPin2 <<8|GpioAf1)
#define PA03_UART1_RXD    (GpioPortA<<16|GpioPin3 <<8|GpioAf1)
#define PA04_SPI0_CS      (GpioPortA<<16|GpioPin4 <<8|GpioAf1)
#define PA05_SPI0_SCK     (GpioPortA<<16|GpioPin5 <<8|GpioAf1)
#define PA06_SPI0_MISO    (GpioPortA<<16|GpioPin6 <<8|GpioAf1)
#define PA07_SPI0_MOSI    (GpioPortA<<16|GpioPin7 <<8|GpioAf1)
#define PA08_UART0_TXD    (GpioPortA<<16|GpioPin8 <<8|GpioAf1)
#define PA09_UART0_TXD    (GpioPortA<<16|GpioPin9 <<8|GpioAf1)
#define PA10_UART0_RXD    (GpioPortA<<16|GpioPin10<<8|GpioAf1)
#define PA11_UART0_CTS    (GpioPortA<<16|GpioPin11<<8|GpioAf1)
#define PA12_UART0_RTS    (GpioPortA<<16|GpioPin12<<8|GpioAf1)
#define PA13_IR_OUT       (GpioPortA<<16|GpioPin13<<8|GpioAf1)
#define PA14_UART1_TXD    (GpioPortA<<16|GpioPin14<<8|GpioAf1)
#define PA15_SPI0_CS      (GpioPortA<<16|GpioPin15<<8|GpioAf1)
#define PB00_PCA_CH2      (GpioPortB<<16|GpioPin0 <<8|GpioAf1)
#define PB01_PCA_CH3      (GpioPortB<<16|GpioPin1 <<8|GpioAf1)
#define PB02_LPTIM_TOG    (GpioPortB<<16|GpioPin2 <<8|GpioAf1)
#define PB03_SPI0_SCK     (GpioPortB<<16|GpioPin3 <<8|GpioAf1)
#define PB04_SPI0_MISO    (GpioPortB<<16|GpioPin4 <<8|GpioAf1)
#define PB05_SPI0_MOSI    (GpioPortB<<16|GpioPin5 <<8|GpioAf1)
#define PB06_I2C0_SCL     (GpioPortB<<16|GpioPin6 <<8|GpioAf1)
#define PB07_I2C0_SDA     (GpioPortB<<16|GpioPin7 <<8|GpioAf1)
#define PB08_I2C0_SCL     (GpioPortB<<16|GpioPin8 <<8|GpioAf1)
#define PB09_I2C0_SDA     (GpioPortB<<16|GpioPin9 <<8|GpioAf1)
#define PB10_I2C1_SCL     (GpioPortB<<16|GpioPin10<<8|GpioAf1)
#define PB11_I2C1_SDA     (GpioPortB<<16|GpioPin11<<8|GpioAf1)
#define PB12_SPI1_CS      (GpioPortB<<16|GpioPin12<<8|GpioAf1)
#define PB13_SPI1_SCK     (GpioPortB<<16|GpioPin13<<8|GpioAf1)
#define PB14_SPI1_MISO    (GpioPortB<<16|GpioPin14<<8|GpioAf1)
#define PB15_SPI1_MOSI    (GpioPortB<<16|GpioPin15<<8|GpioAf1)
#define PC00_LPTIM_GATE   (GpioPortC<<16|GpioPin0 <<8|GpioAf1)
#define PC01_LPTIM_TOG    (GpioPortC<<16|GpioPin1 <<8|GpioAf1)
#define PC02_SPI1_MISO    (GpioPortC<<16|GpioPin2 <<8|GpioAf1)
#define PC03_SPI1_MOSI    (GpioPortC<<16|GpioPin3 <<8|GpioAf1)
#define PC04_LPUART0_TXD  (GpioPortC<<16|GpioPin4 <<8|GpioAf1)
#define PC05_LPUART0_RXD  (GpioPortC<<16|GpioPin5 <<8|GpioAf1)
#define PC06_PCA_CH0      (GpioPortC<<16|GpioPin6 <<8|GpioAf1)
#define PC07_PCA_CH1      (GpioPortC<<16|GpioPin7 <<8|GpioAf1)
#define PC08_PCA_CH2      (GpioPortC<<16|GpioPin8 <<8|GpioAf1)
#define PC09_PCA_CH3      (GpioPortC<<16|GpioPin9 <<8|GpioAf1)
#define PC10_LPUART1_TXD  (GpioPortC<<16|GpioPin10<<8|GpioAf1)
#define PC11_LPUART1_RXD  (GpioPortC<<16|GpioPin11<<8|GpioAf1)
#define PC12_LPUART0_TXD  (GpioPortC<<16|GpioPin12<<8|GpioAf1)
#define PC13_1x           (GpioPortC<<16|GpioPin13<<8|GpioAf1)
#define PC14_1x           (GpioPortC<<16|GpioPin14<<8|GpioAf1)
#define PC15_1x           (GpioPortC<<16|GpioPin15<<8|GpioAf1)
#define PD00_1x           (GpioPortD<<16|GpioPin0 <<8|GpioAf1)
#define PD01_1x           (GpioPortD<<16|GpioPin1 <<8|GpioAf1)
#define PD02_PCA_ECI      (GpioPortD<<16|GpioPin2 <<8|GpioAf1)
#define PD03_UART1_CTS    (GpioPortD<<16|GpioPin3 <<8|GpioAf1)
#define PD04_UART1_RTS    (GpioPortD<<16|GpioPin4 <<8|GpioAf1)
#define PD05_UART1_TXD    (GpioPortD<<16|GpioPin5 <<8|GpioAf1)
#define PD06_UART1_RXD    (GpioPortD<<16|GpioPin6 <<8|GpioAf1)
#define PD07_UART1_TXD    (GpioPortD<<16|GpioPin7 <<8|GpioAf1)
#define PD08_LPUART0_TXD  (GpioPortD<<16|GpioPin8 <<8|GpioAf1)
#define PD09_LPUART0_RXD  (GpioPortD<<16|GpioPin9 <<8|GpioAf1)
#define PD10_LPUART0_TXD  (GpioPortD<<16|GpioPin10<<8|GpioAf1)
#define PD11_LPUART0_CTS  (GpioPortD<<16|GpioPin11<<8|GpioAf1)
#define PD12_LPUART0_RTS  (GpioPortD<<16|GpioPin12<<8|GpioAf1)
#define PD13_UART2_RXD    (GpioPortD<<16|GpioPin13<<8|GpioAf1)
#define PD14_UART2_TXD    (GpioPortD<<16|GpioPin14<<8|GpioAf1)
#define PD15_1x           (GpioPortD<<16|GpioPin15<<8|GpioAf1)
#define PE00_TIM1_CHA     (GpioPortE<<16|GpioPin0 <<8|GpioAf1)
#define PE01_TIM2_CHA     (GpioPortE<<16|GpioPin1 <<8|GpioAf1)
#define PE02_PCA_ECI      (GpioPortE<<16|GpioPin2 <<8|GpioAf1)
#define PE03_PCA_CH0      (GpioPortE<<16|GpioPin3 <<8|GpioAf1)
#define PE04_PCA_CH1      (GpioPortE<<16|GpioPin4 <<8|GpioAf1)
#define PE05_PCA_CH2      (GpioPortE<<16|GpioPin5 <<8|GpioAf1)
#define PE06_PCA_CH3      (GpioPortE<<16|GpioPin6 <<8|GpioAf1)
#define PE07_TIM3_ETR     (GpioPortE<<16|GpioPin7 <<8|GpioAf1)
#define PE08_TIM3_CH0B    (GpioPortE<<16|GpioPin8 <<8|GpioAf1)
#define PE09_TIM3_CH0A    (GpioPortE<<16|GpioPin9 <<8|GpioAf1)
#define PE10_TIM3_CH1B    (GpioPortE<<16|GpioPin10<<8|GpioAf1)
#define PE11_TIM3_CH1A    (GpioPortE<<16|GpioPin11<<8|GpioAf1)
#define PE12_TIM3_CH2B    (GpioPortE<<16|GpioPin12<<8|GpioAf1)
#define PE13_TIM3_CH2A    (GpioPortE<<16|GpioPin13<<8|GpioAf1)
#define PE14_TIM3_CH0B    (GpioPortE<<16|GpioPin14<<8|GpioAf1)
#define PE15_TIM3_BK      (GpioPortE<<16|GpioPin15<<8|GpioAf1)
#define PF00_I2C0_SDA     (GpioPortF<<16|GpioPin0 <<8|GpioAf1)
#define PF01_I2C0_SCL     (GpioPortF<<16|GpioPin1 <<8|GpioAf1)
#define PF02_1x           (GpioPortF<<16|GpioPin2 <<8|GpioAf1)
#define PF03_1x           (GpioPortF<<16|GpioPin3 <<8|GpioAf1)
#define PF04_1x           (GpioPortF<<16|GpioPin4 <<8|GpioAf1)
#define PF05_1x           (GpioPortF<<16|GpioPin5 <<8|GpioAf1)
#define PF06_I2C1_SCL     (GpioPortF<<16|GpioPin6 <<8|GpioAf1)
#define PF07_I2C1_SDA     (GpioPortF<<16|GpioPin7 <<8|GpioAf1)
#define PF09_TIM0_CHA     (GpioPortF<<16|GpioPin9 <<8|GpioAf1)
#define PF10_TIM0_CHB     (GpioPortF<<16|GpioPin10<<8|GpioAf1)
#define PF11_1x           (GpioPortF<<16|GpioPin11<<8|GpioAf1)


 ///< GpioAf2
#define PA00_LPUART1_TXD  (GpioPortA<<16|GpioPin0 <<8|GpioAf2)
#define PA01_LPUART1_RXD  (GpioPortA<<16|GpioPin1 <<8|GpioAf2)
#define PA02_TIM0_CHA     (GpioPortA<<16|GpioPin2 <<8|GpioAf2)
#define PA03_TIM0_GATE    (GpioPortA<<16|GpioPin3 <<8|GpioAf2)
#define PA04_UART1_TXD    (GpioPortA<<16|GpioPin4 <<8|GpioAf2)
#define PA05_TIM0_ETR     (GpioPortA<<16|GpioPin5 <<8|GpioAf2)
#define PA06_PCA_CH0      (GpioPortA<<16|GpioPin6 <<8|GpioAf2)
#define PA07_PCA_CH1      (GpioPortA<<16|GpioPin7 <<8|GpioAf2)
#define PA08_TIM3_CH0A    (GpioPortA<<16|GpioPin8 <<8|GpioAf2)
#define PA09_TIM3_CH1A    (GpioPortA<<16|GpioPin9 <<8|GpioAf2)
#define PA10_TIM3_CH2A    (GpioPortA<<16|GpioPin10<<8|GpioAf2)
#define PA11_TIM3_GATE    (GpioPortA<<16|GpioPin11<<8|GpioAf2)
#define PA12_TIM3_ETR     (GpioPortA<<16|GpioPin12<<8|GpioAf2)
#define PA13_UART0_RXD    (GpioPortA<<16|GpioPin13<<8|GpioAf2)
#define PA14_UART0_TXD    (GpioPortA<<16|GpioPin14<<8|GpioAf2)
#define PA15_UART1_RXD    (GpioPortA<<16|GpioPin15<<8|GpioAf2)
#define PB00_TIM3_CH1B    (GpioPortB<<16|GpioPin0 <<8|GpioAf2)
#define PB01_PCLK_OUT     (GpioPortB<<16|GpioPin1 <<8|GpioAf2)
#define PB02_PCA_ECI      (GpioPortB<<16|GpioPin2 <<8|GpioAf2)
#define PB03_TIM0_CHB     (GpioPortB<<16|GpioPin3 <<8|GpioAf2)
#define PB04_PCA_CH0      (GpioPortB<<16|GpioPin4 <<8|GpioAf2)
#define PB05_2x           (GpioPortB<<16|GpioPin5 <<8|GpioAf2)
#define PB06_UART0_TXD    (GpioPortB<<16|GpioPin6 <<8|GpioAf2)
#define PB07_UART0_RXD    (GpioPortB<<16|GpioPin7 <<8|GpioAf2)
#define PB08_TIM1_CHA     (GpioPortB<<16|GpioPin8 <<8|GpioAf2)
#define PB09_IR_OUT       (GpioPortB<<16|GpioPin9 <<8|GpioAf2)
#define PB10_SPI1_SCK     (GpioPortB<<16|GpioPin10<<8|GpioAf2)
#define PB11_TIM1_CHB     (GpioPortB<<16|GpioPin11<<8|GpioAf2)
#define PB12_TIM3_BK      (GpioPortB<<16|GpioPin12<<8|GpioAf2)
#define PB13_I2C1_SCL     (GpioPortB<<16|GpioPin13<<8|GpioAf2)
#define PB14_I2C1_SDA     (GpioPortB<<16|GpioPin14<<8|GpioAf2)
#define PB15_TIM3_CH2B    (GpioPortB<<16|GpioPin15<<8|GpioAf2)
#define PC00_PCNT_S0      (GpioPortC<<16|GpioPin0 <<8|GpioAf2)
#define PC01_TIM5_CHB     (GpioPortC<<16|GpioPin1 <<8|GpioAf2)
#define PC02_LPTIM_TOGN   (GpioPortC<<16|GpioPin2 <<8|GpioAf2)
#define PC03_LPTIM_ETR    (GpioPortC<<16|GpioPin3 <<8|GpioAf2)
#define PC04_TIM2_ETR     (GpioPortC<<16|GpioPin4 <<8|GpioAf2)
#define PC05_TIM6_CHB     (GpioPortC<<16|GpioPin5 <<8|GpioAf2)
#define PC06_TIM4_CHA     (GpioPortC<<16|GpioPin6 <<8|GpioAf2)
#define PC07_TIM5_CHA     (GpioPortC<<16|GpioPin7 <<8|GpioAf2)
#define PC08_TIM6_CHA     (GpioPortC<<16|GpioPin8 <<8|GpioAf2)
#define PC09_TIM4_CHB     (GpioPortC<<16|GpioPin9 <<8|GpioAf2)
#define PC10_LPUART0_TXD  (GpioPortC<<16|GpioPin10<<8|GpioAf2)
#define PC11_LPUART0_RXD  (GpioPortC<<16|GpioPin11<<8|GpioAf2)
#define PC12_LPUART1_TXD  (GpioPortC<<16|GpioPin12<<8|GpioAf2)
#define PC13_RTC_1HZ      (GpioPortC<<16|GpioPin13<<8|GpioAf2)
#define PC14_2x           (GpioPortC<<16|GpioPin14<<8|GpioAf2)
#define PC15_2x           (GpioPortC<<16|GpioPin15<<8|GpioAf2)
#define PD00_SPI1_CS      (GpioPortD<<16|GpioPin0 <<8|GpioAf2)
#define PD01_SPI1_SCK     (GpioPortD<<16|GpioPin1 <<8|GpioAf2)
#define PD02_LPUART0_RTS  (GpioPortD<<16|GpioPin2 <<8|GpioAf2)
#define PD03_SPI1_MISO    (GpioPortD<<16|GpioPin3 <<8|GpioAf2)
#define PD04_SPI1_MOSI    (GpioPortD<<16|GpioPin4 <<8|GpioAf2)
#define PD05_LPTIM1_GATE  (GpioPortD<<16|GpioPin5 <<8|GpioAf2)
#define PD06_LPTIM1_ETR   (GpioPortD<<16|GpioPin6 <<8|GpioAf2)
#define PD07_2x           (GpioPortD<<16|GpioPin7 <<8|GpioAf2)
#define PD08_2x           (GpioPortD<<16|GpioPin8 <<8|GpioAf2)
#define PD09_2x           (GpioPortD<<16|GpioPin9 <<8|GpioAf2)
#define PD10_2x           (GpioPortD<<16|GpioPin10<<8|GpioAf2)
#define PD11_2x           (GpioPortD<<16|GpioPin11<<8|GpioAf2)
#define PD12_UART2_RTS    (GpioPortD<<16|GpioPin12<<8|GpioAf2)
#define PD13_2x           (GpioPortD<<16|GpioPin13<<8|GpioAf2)
#define PD14_2x           (GpioPortD<<16|GpioPin14<<8|GpioAf2)
#define PD15_UART2_CTS    (GpioPortD<<16|GpioPin15<<8|GpioAf2)
#define PE00_2x           (GpioPortE<<16|GpioPin0 <<8|GpioAf2)
#define PE01_2x           (GpioPortE<<16|GpioPin1 <<8|GpioAf2)
#define PE02_2x           (GpioPortE<<16|GpioPin2 <<8|GpioAf2)
#define PE03_2x           (GpioPortE<<16|GpioPin3 <<8|GpioAf2)
#define PE04_2x           (GpioPortE<<16|GpioPin4 <<8|GpioAf2)
#define PE05_2x           (GpioPortE<<16|GpioPin5 <<8|GpioAf2)
#define PE06_2x           (GpioPortE<<16|GpioPin6 <<8|GpioAf2)
#define PE07_LPTIM1_GATE  (GpioPortE<<16|GpioPin7 <<8|GpioAf2)
#define PE08_LPTIM1_ETR   (GpioPortE<<16|GpioPin8 <<8|GpioAf2)
#define PE09_LPTIM1_TOG   (GpioPortE<<16|GpioPin9 <<8|GpioAf2)
#define PE10_LPTIM1_TOGN  (GpioPortE<<16|GpioPin10<<8|GpioAf2)
#define PE11_2x           (GpioPortE<<16|GpioPin11<<8|GpioAf2)
#define PE12_SPI0_CS      (GpioPortE<<16|GpioPin12<<8|GpioAf2)
#define PE13_SPI0_SCK     (GpioPortE<<16|GpioPin13<<8|GpioAf2)
#define PE14_SPI0_MISO    (GpioPortE<<16|GpioPin14<<8|GpioAf2)
#define PE15_SPI0_MOSI    (GpioPortE<<16|GpioPin15<<8|GpioAf2)
#define PF00_2x           (GpioPortF<<16|GpioPin0 <<8|GpioAf2)
#define PF01_TIM4_CHB     (GpioPortF<<16|GpioPin1 <<8|GpioAf2)
#define PF02_2x           (GpioPortF<<16|GpioPin2 <<8|GpioAf2)
#define PF03_2x           (GpioPortF<<16|GpioPin3 <<8|GpioAf2)
#define PF04_2x           (GpioPortF<<16|GpioPin4 <<8|GpioAf2)
#define PF05_2x           (GpioPortF<<16|GpioPin5 <<8|GpioAf2)
#define PF06_LPUART1_CTS  (GpioPortF<<16|GpioPin6 <<8|GpioAf2)
#define PF07_LPUART1_RTS  (GpioPortF<<16|GpioPin7 <<8|GpioAf2)
#define PF09_2x           (GpioPortF<<16|GpioPin9 <<8|GpioAf2)
#define PF10_2x           (GpioPortF<<16|GpioPin10<<8|GpioAf2)
#define PF11_2x           (GpioPortF<<16|GpioPin11<<8|GpioAf2)

///< GpioAf3
#define PA00_TIM0_ETR     (GpioPortA<<16|GpioPin0 <<8|GpioAf3)
#define PA01_TIM0_CHB     (GpioPortA<<16|GpioPin1 <<8|GpioAf3)
#define PA02_VC1_OUT      (GpioPortA<<16|GpioPin2 <<8|GpioAf3)
#define PA03_TIM1_CHB     (GpioPortA<<16|GpioPin3 <<8|GpioAf3)
#define PA04_PCA_CH4      (GpioPortA<<16|GpioPin4 <<8|GpioAf3)
#define PA05_PCA_ECI      (GpioPortA<<16|GpioPin5 <<8|GpioAf3)
#define PA06_TIM3_BK      (GpioPortA<<16|GpioPin6 <<8|GpioAf3)
#define PA07_HCLK_OUT     (GpioPortA<<16|GpioPin7 <<8|GpioAf3)
#define PA08_3x           (GpioPortA<<16|GpioPin8 <<8|GpioAf3)
#define PA09_TIM0_BK      (GpioPortA<<16|GpioPin9 <<8|GpioAf3)
#define PA10_TIM2_BK      (GpioPortA<<16|GpioPin10<<8|GpioAf3)
#define PA11_I2C1_SCL     (GpioPortA<<16|GpioPin11<<8|GpioAf3)
#define PA12_I2C1_SDA     (GpioPortA<<16|GpioPin12<<8|GpioAf3)
#define PA13_LVD_OUT      (GpioPortA<<16|GpioPin13<<8|GpioAf3)
#define PA14_TIM3_CH2A    (GpioPortA<<16|GpioPin14<<8|GpioAf3)
#define PA15_LPUART1_RTS  (GpioPortA<<16|GpioPin15<<8|GpioAf3)
#define PB00_LPUART0_TXD  (GpioPortB<<16|GpioPin0 <<8|GpioAf3)
#define PB01_TIM3_CH2B    (GpioPortB<<16|GpioPin1 <<8|GpioAf3)
#define PB02_LPUART1_TXD  (GpioPortB<<16|GpioPin2 <<8|GpioAf3)
#define PB03_TIM1_GATE    (GpioPortB<<16|GpioPin3 <<8|GpioAf3)
#define PB04_TIM2_BK      (GpioPortB<<16|GpioPin4 <<8|GpioAf3)
#define PB05_TIM1_BK      (GpioPortB<<16|GpioPin5 <<8|GpioAf3)
#define PB06_TIM1_CHB     (GpioPortB<<16|GpioPin6 <<8|GpioAf3)
#define PB07_TIM2_CHB     (GpioPortB<<16|GpioPin7 <<8|GpioAf3)
#define PB08_3x           (GpioPortB<<16|GpioPin8 <<8|GpioAf3)
#define PB09_SPI1_CS      (GpioPortB<<16|GpioPin9 <<8|GpioAf3)
#define PB10_TIM1_CHA     (GpioPortB<<16|GpioPin10<<8|GpioAf3)
#define PB11_LPUART0_RXD  (GpioPortB<<16|GpioPin11<<8|GpioAf3)
#define PB12_LPUART0_TXD  (GpioPortB<<16|GpioPin12<<8|GpioAf3)
#define PB13_TIM3_CH0B    (GpioPortB<<16|GpioPin13<<8|GpioAf3)
#define PB14_TIM3_CH1B    (GpioPortB<<16|GpioPin14<<8|GpioAf3)
#define PB15_TIM0_CHB     (GpioPortB<<16|GpioPin15<<8|GpioAf3)
#define PC00_UART1_CTS    (GpioPortC<<16|GpioPin0 <<8|GpioAf3)
#define PC01_UART1_RTS    (GpioPortC<<16|GpioPin1 <<8|GpioAf3)
#define PC02_PCNT_S1      (GpioPortC<<16|GpioPin2 <<8|GpioAf3)
#define PC03_LPTIM_TOGN   (GpioPortC<<16|GpioPin3 <<8|GpioAf3)
#define PC04_IR_OUT       (GpioPortC<<16|GpioPin4 <<8|GpioAf3)
#define PC05_PCA_CH4      (GpioPortC<<16|GpioPin5 <<8|GpioAf3)
#define PC06_TIM2_CHA     (GpioPortC<<16|GpioPin6 <<8|GpioAf3)
#define PC07_TIM2_CHB     (GpioPortC<<16|GpioPin7 <<8|GpioAf3)
#define PC08_TIM2_ETR     (GpioPortC<<16|GpioPin8 <<8|GpioAf3)
#define PC09_TIM1_ETR     (GpioPortC<<16|GpioPin9 <<8|GpioAf3)
#define PC10_PCA_CH2      (GpioPortC<<16|GpioPin10<<8|GpioAf3)
#define PC11_PCA_CH3      (GpioPortC<<16|GpioPin11<<8|GpioAf3)
#define PC12_PCA_CH4      (GpioPortC<<16|GpioPin12<<8|GpioAf3)
#define PC13_TIM3_CH1B    (GpioPortC<<16|GpioPin13<<8|GpioAf3)
#define PC14_3x           (GpioPortC<<16|GpioPin14<<8|GpioAf3)
#define PC15_3x           (GpioPortC<<16|GpioPin15<<8|GpioAf3)
#define PD00_3x           (GpioPortD<<16|GpioPin0 <<8|GpioAf3)
#define PD01_3x           (GpioPortD<<16|GpioPin1 <<8|GpioAf3)
#define PD02_TIM1_ETR     (GpioPortD<<16|GpioPin2 <<8|GpioAf3)
#define PD03_LPTIM1_TOG   (GpioPortD<<16|GpioPin3 <<8|GpioAf3)
#define PD04_LPTIM1_TOGN  (GpioPortD<<16|GpioPin4 <<8|GpioAf3)
#define PD05_3x           (GpioPortD<<16|GpioPin5 <<8|GpioAf3)
#define PD06_3x           (GpioPortD<<16|GpioPin6 <<8|GpioAf3)
#define PD07_3x           (GpioPortD<<16|GpioPin7 <<8|GpioAf3)
#define PD08_3x           (GpioPortD<<16|GpioPin8 <<8|GpioAf3)
#define PD09_3x           (GpioPortD<<16|GpioPin9 <<8|GpioAf3)
#define PD10_3x           (GpioPortD<<16|GpioPin10<<8|GpioAf3)
#define PD11_3x           (GpioPortD<<16|GpioPin11<<8|GpioAf3)
#define PD12_3x           (GpioPortD<<16|GpioPin12<<8|GpioAf3)
#define PD13_3x           (GpioPortD<<16|GpioPin13<<8|GpioAf3)
#define PD14_3x           (GpioPortD<<16|GpioPin14<<8|GpioAf3)
#define PD15_3x           (GpioPortD<<16|GpioPin15<<8|GpioAf3)
#define PE00_3x           (GpioPortE<<16|GpioPin0 <<8|GpioAf3)
#define PE01_3x           (GpioPortE<<16|GpioPin1 <<8|GpioAf3)
#define PE02_3x           (GpioPortE<<16|GpioPin2 <<8|GpioAf3)
#define PE03_3x           (GpioPortE<<16|GpioPin3 <<8|GpioAf3)
#define PE04_3x           (GpioPortE<<16|GpioPin4 <<8|GpioAf3)
#define PE05_3x           (GpioPortE<<16|GpioPin5 <<8|GpioAf3)
#define PE06_3x           (GpioPortE<<16|GpioPin6 <<8|GpioAf3)
#define PE07_3x           (GpioPortE<<16|GpioPin7 <<8|GpioAf3)
#define PE08_3x           (GpioPortE<<16|GpioPin8 <<8|GpioAf3)
#define PE09_3x           (GpioPortE<<16|GpioPin9 <<8|GpioAf3)
#define PE10_3x           (GpioPortE<<16|GpioPin10<<8|GpioAf3)
#define PE11_3x           (GpioPortE<<16|GpioPin11<<8|GpioAf3)
#define PE12_UART3_CTS    (GpioPortE<<16|GpioPin12<<8|GpioAf3)
#define PE13_UART3_RTS    (GpioPortE<<16|GpioPin13<<8|GpioAf3)
#define PE14_UART3_RXD    (GpioPortE<<16|GpioPin14<<8|GpioAf3)
#define PE15_UART3_TXD    (GpioPortE<<16|GpioPin15<<8|GpioAf3)
#define PF00_UART1_TXD    (GpioPortF<<16|GpioPin0 <<8|GpioAf3)
#define PF01_UART1_RXD    (GpioPortF<<16|GpioPin1 <<8|GpioAf3)
#define PF02_3x           (GpioPortF<<16|GpioPin2 <<8|GpioAf3)
#define PF03_3x           (GpioPortF<<16|GpioPin3 <<8|GpioAf3)
#define PF04_3x           (GpioPortF<<16|GpioPin4 <<8|GpioAf3)
#define PF05_3x           (GpioPortF<<16|GpioPin5 <<8|GpioAf3)
#define PF06_UART0_CTS    (GpioPortF<<16|GpioPin6 <<8|GpioAf3)
#define PF07_UART0_RTS    (GpioPortF<<16|GpioPin7 <<8|GpioAf3)
#define PF09_3x           (GpioPortF<<16|GpioPin9 <<8|GpioAf3)
#define PF10_3x           (GpioPortF<<16|GpioPin10<<8|GpioAf3)
#define PF11_3x           (GpioPortF<<16|GpioPin11<<8|GpioAf3)

///< GpioAf4
#define PA00_VC0_OUT      (GpioPortA<<16|GpioPin0 <<8|GpioAf4)
#define PA01_TIM1_ETR     (GpioPortA<<16|GpioPin1 <<8|GpioAf4)
#define PA02_TIM1_CHA     (GpioPortA<<16|GpioPin2 <<8|GpioAf4)
#define PA03_TIM2_CHB     (GpioPortA<<16|GpioPin3 <<8|GpioAf4)
#define PA04_TIM2_ETR     (GpioPortA<<16|GpioPin4 <<8|GpioAf4)
#define PA05_TIM0_CHA     (GpioPortA<<16|GpioPin5 <<8|GpioAf4)
#define PA06_TIM1_CHA     (GpioPortA<<16|GpioPin6 <<8|GpioAf4)
#define PA07_TIM3_CH0B    (GpioPortA<<16|GpioPin7 <<8|GpioAf4)
#define PA08_4x           (GpioPortA<<16|GpioPin8 <<8|GpioAf4)
#define PA09_I2C0_SCL     (GpioPortA<<16|GpioPin9 <<8|GpioAf4)
#define PA10_I2C0_SDA     (GpioPortA<<16|GpioPin10<<8|GpioAf4)
#define PA11_4x           (GpioPortA<<16|GpioPin11<<8|GpioAf4)
#define PA12_4x           (GpioPortA<<16|GpioPin12<<8|GpioAf4)
#define PA13_TIM3_ETR     (GpioPortA<<16|GpioPin13<<8|GpioAf4)
#define PA14_LVD_OUT      (GpioPortA<<16|GpioPin14<<8|GpioAf4)
#define PA15_TIM0_ETR     (GpioPortA<<16|GpioPin15<<8|GpioAf4)
#define PB00_TIM5_CHB     (GpioPortB<<16|GpioPin0 <<8|GpioAf4)
#define PB01_TIM6_CHB     (GpioPortB<<16|GpioPin1 <<8|GpioAf4)
#define PB02_TIM4_CHA     (GpioPortB<<16|GpioPin2 <<8|GpioAf4)
#define PB03_TIM3_CH0A    (GpioPortB<<16|GpioPin3 <<8|GpioAf4)
#define PB04_UART0_CTS    (GpioPortB<<16|GpioPin4 <<8|GpioAf4)
#define PB05_PCA_CH1      (GpioPortB<<16|GpioPin5 <<8|GpioAf4)
#define PB06_TIM0_CHA     (GpioPortB<<16|GpioPin6 <<8|GpioAf4)
#define PB07_LPUART1_CTS  (GpioPortB<<16|GpioPin7 <<8|GpioAf4)
#define PB08_TIM2_CHA     (GpioPortB<<16|GpioPin8 <<8|GpioAf4)
#define PB09_TIM2_CHA     (GpioPortB<<16|GpioPin9 <<8|GpioAf4)
#define PB10_LPUART0_TXD  (GpioPortB<<16|GpioPin10<<8|GpioAf4)
#define PB11_TIM2_GATE    (GpioPortB<<16|GpioPin11<<8|GpioAf4)
#define PB12_TIM0_BK      (GpioPortB<<16|GpioPin12<<8|GpioAf4)
#define PB13_LPUART0_CTS  (GpioPortB<<16|GpioPin13<<8|GpioAf4)
#define PB14_TIM0_CHA     (GpioPortB<<16|GpioPin14<<8|GpioAf4)
#define PB15_TIM0_GATE    (GpioPortB<<16|GpioPin15<<8|GpioAf4)
#define PC00_UART2_RTS    (GpioPortC<<16|GpioPin0 <<8|GpioAf4)
#define PC01_PCNT_S0FO    (GpioPortC<<16|GpioPin1 <<8|GpioAf4)
#define PC02_UART2_RXD    (GpioPortC<<16|GpioPin2 <<8|GpioAf4)
#define PC03_PCNT_S1FO    (GpioPortC<<16|GpioPin3 <<8|GpioAf4)
#define PC04_VC2_OUT      (GpioPortC<<16|GpioPin4 <<8|GpioAf4)
#define PC05_4x           (GpioPortC<<16|GpioPin5 <<8|GpioAf4)
#define PC06_LPTIM1_GATE  (GpioPortC<<16|GpioPin6 <<8|GpioAf4)
#define PC07_LPTIM1_ETR   (GpioPortC<<16|GpioPin7 <<8|GpioAf4)
#define PC08_LPTIM1_TOG   (GpioPortC<<16|GpioPin8 <<8|GpioAf4)
#define PC09_LPTIM1_TOGN  (GpioPortC<<16|GpioPin9 <<8|GpioAf4)
#define PC10_4x           (GpioPortC<<16|GpioPin10<<8|GpioAf4)
#define PC11_PCNT_S0FO    (GpioPortC<<16|GpioPin11<<8|GpioAf4)
#define PC12_PCNT_S1FO    (GpioPortC<<16|GpioPin12<<8|GpioAf4)
#define PC13_4x           (GpioPortC<<16|GpioPin13<<8|GpioAf4)
#define PC14_4x           (GpioPortC<<16|GpioPin14<<8|GpioAf4)
#define PC15_4x           (GpioPortC<<16|GpioPin15<<8|GpioAf4)
#define PD00_4x           (GpioPortD<<16|GpioPin0 <<8|GpioAf4)
#define PD01_4x           (GpioPortD<<16|GpioPin1 <<8|GpioAf4)
#define PD02_4x           (GpioPortD<<16|GpioPin2 <<8|GpioAf4)
#define PD03_4x           (GpioPortD<<16|GpioPin3 <<8|GpioAf4)
#define PD04_4x           (GpioPortD<<16|GpioPin4 <<8|GpioAf4)
#define PD05_4x           (GpioPortD<<16|GpioPin5 <<8|GpioAf4)
#define PD06_4x           (GpioPortD<<16|GpioPin6 <<8|GpioAf4)
#define PD07_4x           (GpioPortD<<16|GpioPin7 <<8|GpioAf4)
#define PD08_4x           (GpioPortD<<16|GpioPin8 <<8|GpioAf4)
#define PD09_4x           (GpioPortD<<16|GpioPin9 <<8|GpioAf4)
#define PD10_4x           (GpioPortD<<16|GpioPin10<<8|GpioAf4)
#define PD11_4x           (GpioPortD<<16|GpioPin11<<8|GpioAf4)
#define PD12_4x           (GpioPortD<<16|GpioPin12<<8|GpioAf4)
#define PD13_4x           (GpioPortD<<16|GpioPin13<<8|GpioAf4)
#define PD14_4x           (GpioPortD<<16|GpioPin14<<8|GpioAf4)
#define PD15_4x           (GpioPortD<<16|GpioPin15<<8|GpioAf4)
#define PE00_4x           (GpioPortE<<16|GpioPin0 <<8|GpioAf4)
#define PE01_4x           (GpioPortE<<16|GpioPin1 <<8|GpioAf4)
#define PE02_4x           (GpioPortE<<16|GpioPin2 <<8|GpioAf4)
#define PE03_4x           (GpioPortE<<16|GpioPin3 <<8|GpioAf4)
#define PE04_4x           (GpioPortE<<16|GpioPin4 <<8|GpioAf4)
#define PE05_4x           (GpioPortE<<16|GpioPin5 <<8|GpioAf4)
#define PE06_4x           (GpioPortE<<16|GpioPin6 <<8|GpioAf4)
#define PE07_4x           (GpioPortE<<16|GpioPin7 <<8|GpioAf4)
#define PE08_4x           (GpioPortE<<16|GpioPin8 <<8|GpioAf4)
#define PE09_4x           (GpioPortE<<16|GpioPin9 <<8|GpioAf4)
#define PE10_4x           (GpioPortE<<16|GpioPin10<<8|GpioAf4)
#define PE11_4x           (GpioPortE<<16|GpioPin11<<8|GpioAf4)
#define PE12_4x           (GpioPortE<<16|GpioPin12<<8|GpioAf4)
#define PE13_4x           (GpioPortE<<16|GpioPin13<<8|GpioAf4)
#define PE14_4x           (GpioPortE<<16|GpioPin14<<8|GpioAf4)
#define PE15_4x           (GpioPortE<<16|GpioPin15<<8|GpioAf4)
#define PF00_4x           (GpioPortF<<16|GpioPin0 <<8|GpioAf4)
#define PF01_4x           (GpioPortF<<16|GpioPin1 <<8|GpioAf4)
#define PF02_4x           (GpioPortF<<16|GpioPin2 <<8|GpioAf4)
#define PF03_4x           (GpioPortF<<16|GpioPin3 <<8|GpioAf4)
#define PF04_4x           (GpioPortF<<16|GpioPin4 <<8|GpioAf4)
#define PF05_4x           (GpioPortF<<16|GpioPin5 <<8|GpioAf4)
#define PF06_4x           (GpioPortF<<16|GpioPin6 <<8|GpioAf4)
#define PF07_4x           (GpioPortF<<16|GpioPin7 <<8|GpioAf4)
#define PF09_4x           (GpioPortF<<16|GpioPin9 <<8|GpioAf4)
#define PF10_4x           (GpioPortF<<16|GpioPin10<<8|GpioAf4)
#define PF11_4x           (GpioPortF<<16|GpioPin11<<8|GpioAf4)

