Materials-Testing-Lab/hc32-hal/dts/hc32/hc32l19x-pinctrl.h
///< GpioAf5
#define PA00_TIM1_CHA     (GpioPortA<<16|GpioPin0 <<8|GpioAf5)
#define PA01_TIM1_CHB     (GpioPortA<<16|GpioPin1 <<8|GpioAf5)
#define PA02_TIM2_CHA     (GpioPortA<<16|GpioPin2 <<8|GpioAf5)
#define PA03_SPI1_CS      (GpioPortA<<16|GpioPin3 <<8|GpioAf5)
#define PA04_TIM5_CHA     (GpioPortA<<16|GpioPin4 <<8|GpioAf5)
#define PA05_TIM5_CHB     (GpioPortA<<16|GpioPin5 <<8|GpioAf5)
#define PA06_VC0_OUT      (GpioPortA<<16|GpioPin6 <<8|GpioAf5)
#define PA07_TIM2_CHA     (GpioPortA<<16|GpioPin7 <<8|GpioAf5)
#define PA08_TIM1_GATE    (GpioPortA<<16|GpioPin8 <<8|GpioAf5)
#define PA09_5x           (GpioPortA<<16|GpioPin9 <<8|GpioAf5)
#define PA10_TIM2_GATE    (GpioPortA<<16|GpioPin10<<8|GpioAf5)
#define PA11_VC0_OUT      (GpioPortA<<16|GpioPin11<<8|GpioAf5)
#define PA12_VC1_OUT      (GpioPortA<<16|GpioPin12<<8|GpioAf5)
#define PA13_RTC_1HZ      (GpioPortA<<16|GpioPin13<<8|GpioAf5)
#define PA14_RCH_OUT      (GpioPortA<<16|GpioPin14<<8|GpioAf5)
#define PA15_TIM0_CHA     (GpioPortA<<16|GpioPin15<<8|GpioAf5)
#define PB00_RCH_OUT      (GpioPortB<<16|GpioPin0 <<8|GpioAf5)
#define PB01_LPUART0_RTS  (GpioPortB<<16|GpioPin1 <<8|GpioAf5)
#define PB02_TIM1_BK      (GpioPortB<<16|GpioPin2 <<8|GpioAf5)
#define PB03_LPTIM_GATE   (GpioPortB<<16|GpioPin3 <<8|GpioAf5)
#define PB04_TIM2_GATE    (GpioPortB<<16|GpioPin4 <<8|GpioAf5)
#define PB05_LPTIM_GATE   (GpioPortB<<16|GpioPin5 <<8|GpioAf5)
#define PB06_LPTIM_ETR    (GpioPortB<<16|GpioPin6 <<8|GpioAf5)
#define PB07_TIM0_CHB     (GpioPortB<<16|GpioPin7 <<8|GpioAf5)
#define PB08_TIM0_GATE    (GpioPortB<<16|GpioPin8 <<8|GpioAf5)
#define PB09_5x           (GpioPortB<<16|GpioPin9 <<8|GpioAf5)
#define PB10_TIM3_CH1A    (GpioPortB<<16|GpioPin10<<8|GpioAf5)
#define PB11_TIM6_CHA     (GpioPortB<<16|GpioPin11<<8|GpioAf5)
#define PB12_5x           (GpioPortB<<16|GpioPin12<<8|GpioAf5)
#define PB13_TIM1_CHA     (GpioPortB<<16|GpioPin13<<8|GpioAf5)
#define PB14_RTC_1HZ      (GpioPortB<<16|GpioPin14<<8|GpioAf5)
#define PB15_5x           (GpioPortB<<16|GpioPin15<<8|GpioAf5)
#define PC00_5x           (GpioPortC<<16|GpioPin0 <<8|GpioAf5)
#define PC01_5x           (GpioPortC<<16|GpioPin1 <<8|GpioAf5)
#define PC02_5x           (GpioPortC<<16|GpioPin2 <<8|GpioAf5)
#define PC03_UART2_TXD    (GpioPortC<<16|GpioPin3 <<8|GpioAf5)
#define PC04_5x           (GpioPortC<<16|GpioPin4 <<8|GpioAf5)
#define PC05_5x           (GpioPortC<<16|GpioPin5 <<8|GpioAf5)
#define PC06_5x           (GpioPortC<<16|GpioPin6 <<8|GpioAf5)
#define PC07_5x           (GpioPortC<<16|GpioPin7 <<8|GpioAf5)
#define PC08_5x           (GpioPortC<<16|GpioPin8 <<8|GpioAf5)
#define PC09_5x           (GpioPortC<<16|GpioPin9 <<8|GpioAf5)
#define PC10_5x           (GpioPortC<<16|GpioPin10<<8|GpioAf5)
#define PC11_5x           (GpioPortC<<16|GpioPin11<<8|GpioAf5)
#define PC12_5x           (GpioPortC<<16|GpioPin12<<8|GpioAf5)
#define PC13_5x           (GpioPortC<<16|GpioPin13<<8|GpioAf5)
#define PC14_5x           (GpioPortC<<16|GpioPin14<<8|GpioAf5)
#define PC15_5x           (GpioPortC<<16|GpioPin15<<8|GpioAf5)
#define PD00_5x           (GpioPortD<<16|GpioPin0 <<8|GpioAf5)
#define PD01_5x           (GpioPortD<<16|GpioPin1 <<8|GpioAf5)
#define PD02_5x           (GpioPortD<<16|GpioPin2 <<8|GpioAf5)
#define PD03_5x           (GpioPortD<<16|GpioPin3 <<8|GpioAf5)
#define PD04_5x           (GpioPortD<<16|GpioPin4 <<8|GpioAf5)
#define PD05_5x           (GpioPortD<<16|GpioPin5 <<8|GpioAf5)
#define PD06_5x           (GpioPortD<<16|GpioPin6 <<8|GpioAf5)
#define PD07_5x           (GpioPortD<<16|GpioPin7 <<8|GpioAf5)
#define PD08_5x           (GpioPortD<<16|GpioPin8 <<8|GpioAf5)
#define PD09_5x           (GpioPortD<<16|GpioPin9 <<8|GpioAf5)
#define PD10_5x           (GpioPortD<<16|GpioPin10<<8|GpioAf5)
#define PD11_5x           (GpioPortD<<16|GpioPin11<<8|GpioAf5)
#define PD12_5x           (GpioPortD<<16|GpioPin12<<8|GpioAf5)
#define PD13_5x           (GpioPortD<<16|GpioPin13<<8|GpioAf5)
#define PD14_5x           (GpioPortD<<16|GpioPin14<<8|GpioAf5)
#define PD15_5x           (GpioPortD<<16|GpioPin15<<8|GpioAf5)
#define PE00_5x           (GpioPortE<<16|GpioPin0 <<8|GpioAf5)
#define PE01_5x           (GpioPortE<<16|GpioPin1 <<8|GpioAf5)
#define PE02_5x           (GpioPortE<<16|GpioPin2 <<8|GpioAf5)
#define PE03_5x           (GpioPortE<<16|GpioPin3 <<8|GpioAf5)
#define PE04_5x           (GpioPortE<<16|GpioPin4 <<8|GpioAf5)
#define PE05_5x           (GpioPortE<<16|GpioPin5 <<8|GpioAf5)
#define PE06_5x           (GpioPortE<<16|GpioPin6 <<8|GpioAf5)
#define PE07_5x           (GpioPortE<<16|GpioPin7 <<8|GpioAf5)
#define PE08_5x           (GpioPortE<<16|GpioPin8 <<8|GpioAf5)
#define PE09_5x           (GpioPortE<<16|GpioPin9 <<8|GpioAf5)
#define PE10_5x           (GpioPortE<<16|GpioPin10<<8|GpioAf5)
#define PE11_5x           (GpioPortE<<16|GpioPin11<<8|GpioAf5)
#define PE12_5x           (GpioPortE<<16|GpioPin12<<8|GpioAf5)
#define PE13_5x           (GpioPortE<<16|GpioPin13<<8|GpioAf5)
#define PE14_5x           (GpioPortE<<16|GpioPin14<<8|GpioAf5)
#define PE15_5x           (GpioPortE<<16|GpioPin15<<8|GpioAf5)
#define PF00_5x           (GpioPortF<<16|GpioPin0 <<8|GpioAf5)
#define PF01_5x           (GpioPortF<<16|GpioPin1 <<8|GpioAf5)
#define PF02_5x           (GpioPortF<<16|GpioPin2 <<8|GpioAf5)
#define PF03_5x           (GpioPortF<<16|GpioPin3 <<8|GpioAf5)
#define PF04_5x           (GpioPortF<<16|GpioPin4 <<8|GpioAf5)
#define PF05_5x           (GpioPortF<<16|GpioPin5 <<8|GpioAf5)
#define PF06_5x           (GpioPortF<<16|GpioPin6 <<8|GpioAf5)
#define PF07_5x           (GpioPortF<<16|GpioPin7 <<8|GpioAf5)
#define PF09_5x           (GpioPortF<<16|GpioPin9 <<8|GpioAf5)
#define PF10_5x           (GpioPortF<<16|GpioPin10<<8|GpioAf5)
#define PF11_5x           (GpioPortF<<16|GpioPin11<<8|GpioAf5)

///< GpioAf6
#define PA00_TIM3_ETR     (GpioPortA<<16|GpioPin0 <<8|GpioAf6)
#define PA01_HCLK_OUT     (GpioPortA<<16|GpioPin1 <<8|GpioAf6)
#define PA02_PCLK_OUT     (GpioPortA<<16|GpioPin2 <<8|GpioAf6)
#define PA03_TIM3_CH1A    (GpioPortA<<16|GpioPin3 <<8|GpioAf6)
#define PA04_LVD_OUT      (GpioPortA<<16|GpioPin4 <<8|GpioAf6)
#define PA05_XTL_OUT      (GpioPortA<<16|GpioPin5 <<8|GpioAf6)
#define PA06_TIM3_GATE    (GpioPortA<<16|GpioPin6 <<8|GpioAf6)
#define PA07_VC1_OUT      (GpioPortA<<16|GpioPin7 <<8|GpioAf6)
#define PA08_TIM4_CHA     (GpioPortA<<16|GpioPin8 <<8|GpioAf6)
#define PA09_HCLK_OUT     (GpioPortA<<16|GpioPin9 <<8|GpioAf6)
#define PA10_PCLK_OUT     (GpioPortA<<16|GpioPin10<<8|GpioAf6)
#define PA11_SPI0_MISO    (GpioPortA<<16|GpioPin11<<8|GpioAf6)
#define PA12_SPI0_MOSI    (GpioPortA<<16|GpioPin12<<8|GpioAf6)
#define PA13_PCNT_S1      (GpioPortA<<16|GpioPin13<<8|GpioAf6)
#define PA14_RCL_OUT      (GpioPortA<<16|GpioPin14<<8|GpioAf6)
#define PA15_TIM3_CH1A    (GpioPortA<<16|GpioPin15<<8|GpioAf6)
#define PB00_RCL_OUT      (GpioPortB<<16|GpioPin0 <<8|GpioAf6)
#define PB01_VC2_OUT      (GpioPortB<<16|GpioPin1 <<8|GpioAf6)
#define PB02_TIM0_BK      (GpioPortB<<16|GpioPin2 <<8|GpioAf6)
#define PB03_XTL_OUT      (GpioPortB<<16|GpioPin3 <<8|GpioAf6)
#define PB04_TIM3_CH0B    (GpioPortB<<16|GpioPin4 <<8|GpioAf6)
#define PB05_PCNT_S0      (GpioPortB<<16|GpioPin5 <<8|GpioAf6)
#define PB06_TIM3_CH0A    (GpioPortB<<16|GpioPin6 <<8|GpioAf6)
#define PB07_LPTIM_TOGN   (GpioPortB<<16|GpioPin7 <<8|GpioAf6)
#define PB08_TIM3_CH2A    (GpioPortB<<16|GpioPin8 <<8|GpioAf6)
#define PB09_TIM2_CHB     (GpioPortB<<16|GpioPin9 <<8|GpioAf6)
#define PB10_LPUART1_RTS  (GpioPortB<<16|GpioPin10<<8|GpioAf6)
#define PB11_LPUART1_CTS  (GpioPortB<<16|GpioPin11<<8|GpioAf6)
#define PB12_LPUART0_RTS  (GpioPortB<<16|GpioPin12<<8|GpioAf6)
#define PB13_TIM1_GATE    (GpioPortB<<16|GpioPin13<<8|GpioAf6)
#define PB14_LPUART0_RTS  (GpioPortB<<16|GpioPin14<<8|GpioAf6)
#define PB15_6x           (GpioPortB<<16|GpioPin15<<8|GpioAf6)
#define PC00_6x           (GpioPortC<<16|GpioPin0 <<8|GpioAf6)
#define PC01_UART2_CTS    (GpioPortC<<16|GpioPin1 <<8|GpioAf6)
#define PC02_6x           (GpioPortC<<16|GpioPin2 <<8|GpioAf6)
#define PC03_6x           (GpioPortC<<16|GpioPin3 <<8|GpioAf6)
#define PC04_6x           (GpioPortC<<16|GpioPin4 <<8|GpioAf6)
#define PC05_6x           (GpioPortC<<16|GpioPin5 <<8|GpioAf6)
#define PC06_UART3_RXD    (GpioPortC<<16|GpioPin6 <<8|GpioAf6)
#define PC07_UART3_TXD    (GpioPortC<<16|GpioPin7 <<8|GpioAf6)
#define PC08_UART3_CTS    (GpioPortC<<16|GpioPin8 <<8|GpioAf6)
#define PC09_UART3_RTS    (GpioPortC<<16|GpioPin9 <<8|GpioAf6)
#define PC10_6x           (GpioPortC<<16|GpioPin10<<8|GpioAf6)
#define PC11_6x           (GpioPortC<<16|GpioPin11<<8|GpioAf6)
#define PC12_6x           (GpioPortC<<16|GpioPin12<<8|GpioAf6)
#define PC13_6x           (GpioPortC<<16|GpioPin13<<8|GpioAf6)
#define PC14_6x           (GpioPortC<<16|GpioPin14<<8|GpioAf6)
#define PC15_6x           (GpioPortC<<16|GpioPin15<<8|GpioAf6)
#define PD00_6x           (GpioPortD<<16|GpioPin0 <<8|GpioAf6)
#define PD01_6x           (GpioPortD<<16|GpioPin1 <<8|GpioAf6)
#define PD02_6x           (GpioPortD<<16|GpioPin2 <<8|GpioAf6)
#define PD03_6x           (GpioPortD<<16|GpioPin3 <<8|GpioAf6)
#define PD04_6x           (GpioPortD<<16|GpioPin4 <<8|GpioAf6)
#define PD05_6x           (GpioPortD<<16|GpioPin5 <<8|GpioAf6)
#define PD06_6x           (GpioPortD<<16|GpioPin6 <<8|GpioAf6)
#define PD07_6x           (GpioPortD<<16|GpioPin7 <<8|GpioAf6)
#define PD08_6x           (GpioPortD<<16|GpioPin8 <<8|GpioAf6)
#define PD09_6x           (GpioPortD<<16|GpioPin9 <<8|GpioAf6)
#define PD10_6x           (GpioPortD<<16|GpioPin10<<8|GpioAf6)
#define PD11_6x           (GpioPortD<<16|GpioPin11<<8|GpioAf6)
#define PD12_6x           (GpioPortD<<16|GpioPin12<<8|GpioAf6)
#define PD13_6x           (GpioPortD<<16|GpioPin13<<8|GpioAf6)
#define PD14_6x           (GpioPortD<<16|GpioPin14<<8|GpioAf6)
#define PD15_6x           (GpioPortD<<16|GpioPin15<<8|GpioAf6)
#define PE00_6x           (GpioPortE<<16|GpioPin0 <<8|GpioAf6)
#define PE01_6x           (GpioPortE<<16|GpioPin1 <<8|GpioAf6)
#define PE02_6x           (GpioPortE<<16|GpioPin2 <<8|GpioAf6)
#define PE03_6x           (GpioPortE<<16|GpioPin3 <<8|GpioAf6)
#define PE04_6x           (GpioPortE<<16|GpioPin4 <<8|GpioAf6)
#define PE05_6x           (GpioPortE<<16|GpioPin5 <<8|GpioAf6)
#define PE06_6x           (GpioPortE<<16|GpioPin6 <<8|GpioAf6)
#define PE07_6x           (GpioPortE<<16|GpioPin7 <<8|GpioAf6)
#define PE08_6x           (GpioPortE<<16|GpioPin8 <<8|GpioAf6)
#define PE09_6x           (GpioPortE<<16|GpioPin9 <<8|GpioAf6)
#define PE10_6x           (GpioPortE<<16|GpioPin10<<8|GpioAf6)
#define PE11_6x           (GpioPortE<<16|GpioPin11<<8|GpioAf6)
#define PE12_6x           (GpioPortE<<16|GpioPin12<<8|GpioAf6)
#define PE13_6x           (GpioPortE<<16|GpioPin13<<8|GpioAf6)
#define PE14_6x           (GpioPortE<<16|GpioPin14<<8|GpioAf6)
#define PE15_6x           (GpioPortE<<16|GpioPin15<<8|GpioAf6)
#define PF00_6x           (GpioPortF<<16|GpioPin0 <<8|GpioAf6)
#define PF01_6x           (GpioPortF<<16|GpioPin1 <<8|GpioAf6)
#define PF02_6x           (GpioPortF<<16|GpioPin2 <<8|GpioAf6)
#define PF03_6x           (GpioPortF<<16|GpioPin3 <<8|GpioAf6)
#define PF04_6x           (GpioPortF<<16|GpioPin4 <<8|GpioAf6)
#define PF05_6x           (GpioPortF<<16|GpioPin5 <<8|GpioAf6)
#define PF06_6x           (GpioPortF<<16|GpioPin6 <<8|GpioAf6)
#define PF07_6x           (GpioPortF<<16|GpioPin7 <<8|GpioAf6)
#define PF09_6x           (GpioPortF<<16|GpioPin9 <<8|GpioAf6)
#define PF10_6x           (GpioPortF<<16|GpioPin10<<8|GpioAf6)
#define PF11_6x           (GpioPortF<<16|GpioPin11<<8|GpioAf6)

