Materials-Testing-Lab/hc32-hal/dts/hc32/hc32l19x-pinctrl.h
///< GpioAf7
#define PA00_TIM0_CHA     (GpioPortA<<16|GpioPin0 <<8|GpioAf7)
#define PA01_SPI1_MOSI    (GpioPortA<<16|GpioPin1 <<8|GpioAf7)
#define PA02_SPI1_MISO    (GpioPortA<<16|GpioPin2 <<8|GpioAf7)
#define PA03_TIM5_CHA     (GpioPortA<<16|GpioPin3 <<8|GpioAf7)
#define PA04_TIM3_CH2B    (GpioPortA<<16|GpioPin4 <<8|GpioAf7)
#define PA05_XTH_OUT      (GpioPortA<<16|GpioPin5 <<8|GpioAf7)
#define PA06_LPUART0_CTS  (GpioPortA<<16|GpioPin6 <<8|GpioAf7)
#define PA07_TIM4_CHB     (GpioPortA<<16|GpioPin7 <<8|GpioAf7)
#define PA08_TIM3_BK      (GpioPortA<<16|GpioPin8 <<8|GpioAf7)
#define PA09_TIM5_CHA     (GpioPortA<<16|GpioPin9 <<8|GpioAf7)
#define PA10_TIM6_CHA     (GpioPortA<<16|GpioPin10<<8|GpioAf7)
#define PA11_TIM4_CHB     (GpioPortA<<16|GpioPin11<<8|GpioAf7)
#define PA12_PCNT_S0      (GpioPortA<<16|GpioPin12<<8|GpioAf7)
#define PA13_VC2_OUT      (GpioPortA<<16|GpioPin13<<8|GpioAf7)
#define PA14_PLL_OUT      (GpioPortA<<16|GpioPin14<<8|GpioAf7)
#define PA15_7x           (GpioPortA<<16|GpioPin15<<8|GpioAf7)
#define PB00_PLL_OUT      (GpioPortB<<16|GpioPin0 <<8|GpioAf7)
#define PB01_TCLK_OUT     (GpioPortB<<16|GpioPin1 <<8|GpioAf7)
#define PB02_TIM2_BK      (GpioPortB<<16|GpioPin2 <<8|GpioAf7)
#define PB03_XTH_OUT      (GpioPortB<<16|GpioPin3 <<8|GpioAf7)
#define PB04_LPTIM_ETR    (GpioPortB<<16|GpioPin4 <<8|GpioAf7)
#define PB05_UART0_RTS    (GpioPortB<<16|GpioPin5 <<8|GpioAf7)
#define PB06_LPTIM_TOG    (GpioPortB<<16|GpioPin6 <<8|GpioAf7)
#define PB07_PCNT_S1      (GpioPortB<<16|GpioPin7 <<8|GpioAf7)
#define PB08_UART0_TXD    (GpioPortB<<16|GpioPin8 <<8|GpioAf7)
#define PB09_UART0_RXD    (GpioPortB<<16|GpioPin9 <<8|GpioAf7)
#define PB10_UART1_RTS    (GpioPortB<<16|GpioPin10<<8|GpioAf7)
#define PB11_UART1_CTS    (GpioPortB<<16|GpioPin11<<8|GpioAf7)
#define PB12_TIM6_CHA     (GpioPortB<<16|GpioPin12<<8|GpioAf7)
#define PB13_TIM6_CHB     (GpioPortB<<16|GpioPin13<<8|GpioAf7)
#define PB14_TIM1_BK      (GpioPortB<<16|GpioPin14<<8|GpioAf7)
#define PB15_LPUART1_RXD  (GpioPortB<<16|GpioPin15<<8|GpioAf7)
#define PC00_7x           (GpioPortC<<16|GpioPin0 <<8|GpioAf7)
#define PC01_7x           (GpioPortC<<16|GpioPin1 <<8|GpioAf7)
#define PC02_7x           (GpioPortC<<16|GpioPin2 <<8|GpioAf7)
#define PC03_7x           (GpioPortC<<16|GpioPin3 <<8|GpioAf7)
#define PC04_7x           (GpioPortC<<16|GpioPin4 <<8|GpioAf7)
#define PC05_7x           (GpioPortC<<16|GpioPin5 <<8|GpioAf7)
#define PC06_7x           (GpioPortC<<16|GpioPin6 <<8|GpioAf7)
#define PC07_7x           (GpioPortC<<16|GpioPin7 <<8|GpioAf7)
#define PC08_7x           (GpioPortC<<16|GpioPin8 <<8|GpioAf7)
#define PC09_7x           (GpioPortC<<16|GpioPin9 <<8|GpioAf7)
#define PC10_7x           (GpioPortC<<16|GpioPin10<<8|GpioAf7)
#define PC11_7x           (GpioPortC<<16|GpioPin11<<8|GpioAf7)
#define PC12_7x           (GpioPortC<<16|GpioPin12<<8|GpioAf7)
#define PC13_7x           (GpioPortC<<16|GpioPin13<<8|GpioAf7)
#define PC14_7x           (GpioPortC<<16|GpioPin14<<8|GpioAf7)
#define PC15_7x           (GpioPortC<<16|GpioPin15<<8|GpioAf7)
#define PD00_7x           (GpioPortD<<16|GpioPin0 <<8|GpioAf7)
#define PD01_7x           (GpioPortD<<16|GpioPin1 <<8|GpioAf7)
#define PD02_7x           (GpioPortD<<16|GpioPin2 <<8|GpioAf7)
#define PD03_7x           (GpioPortD<<16|GpioPin3 <<8|GpioAf7)
#define PD04_7x           (GpioPortD<<16|GpioPin4 <<8|GpioAf7)
#define PD05_7x           (GpioPortD<<16|GpioPin5 <<8|GpioAf7)
#define PD06_7x           (GpioPortD<<16|GpioPin6 <<8|GpioAf7)
#define PD07_7x           (GpioPortD<<16|GpioPin7 <<8|GpioAf7)
#define PD08_7x           (GpioPortD<<16|GpioPin8 <<8|GpioAf7)
#define PD09_7x           (GpioPortD<<16|GpioPin9 <<8|GpioAf7)
#define PD10_7x           (GpioPortD<<16|GpioPin10<<8|GpioAf7)
#define PD11_7x           (GpioPortD<<16|GpioPin11<<8|GpioAf7)
#define PD12_7x           (GpioPortD<<16|GpioPin12<<8|GpioAf7)
#define PD13_7x           (GpioPortD<<16|GpioPin13<<8|GpioAf7)
#define PD14_7x           (GpioPortD<<16|GpioPin14<<8|GpioAf7)
#define PD15_7x           (GpioPortD<<16|GpioPin15<<8|GpioAf7)
#define PE00_7x           (GpioPortE<<16|GpioPin0 <<8|GpioAf7)
#define PE01_7x           (GpioPortE<<16|GpioPin1 <<8|GpioAf7)
#define PE02_7x           (GpioPortE<<16|GpioPin2 <<8|GpioAf7)
#define PE03_7x           (GpioPortE<<16|GpioPin3 <<8|GpioAf7)
#define PE04_7x           (GpioPortE<<16|GpioPin4 <<8|GpioAf7)
#define PE05_7x           (GpioPortE<<16|GpioPin5 <<8|GpioAf7)
#define PE06_7x           (GpioPortE<<16|GpioPin6 <<8|GpioAf7)
#define PE07_7x           (GpioPortE<<16|GpioPin7 <<8|GpioAf7)
#define PE08_7x           (GpioPortE<<16|GpioPin8 <<8|GpioAf7)
#define PE09_7x           (GpioPortE<<16|GpioPin9 <<8|GpioAf7)
#define PE10_7x           (GpioPortE<<16|GpioPin10<<8|GpioAf7)
#define PE11_7x           (GpioPortE<<16|GpioPin11<<8|GpioAf7)
#define PE12_7x           (GpioPortE<<16|GpioPin12<<8|GpioAf7)
#define PE13_7x           (GpioPortE<<16|GpioPin13<<8|GpioAf7)
#define PE14_7x           (GpioPortE<<16|GpioPin14<<8|GpioAf7)
#define PE15_7x           (GpioPortE<<16|GpioPin15<<8|GpioAf7)
#define PF00_7x           (GpioPortF<<16|GpioPin0 <<8|GpioAf7)
#define PF01_7x           (GpioPortF<<16|GpioPin1 <<8|GpioAf7)
#define PF02_7x           (GpioPortF<<16|GpioPin2 <<8|GpioAf7)
#define PF03_7x           (GpioPortF<<16|GpioPin3 <<8|GpioAf7)
#define PF04_7x           (GpioPortF<<16|GpioPin4 <<8|GpioAf7)
#define PF05_7x           (GpioPortF<<16|GpioPin5 <<8|GpioAf7)
#define PF06_7x           (GpioPortF<<16|GpioPin6 <<8|GpioAf7)
#define PF07_7x           (GpioPortF<<16|GpioPin7 <<8|GpioAf7)
#define PF09_7x           (GpioPortF<<16|GpioPin9 <<8|GpioAf7)
#define PF10_7x           (GpioPortF<<16|GpioPin10<<8|GpioAf7)
#define PF11_7x           (GpioPortF<<16|GpioPin11<<8|GpioAf7)

#endif
